<!DOCTYPE HTML>
<html lang="ru" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>2.1 Использование Saga Helpers · Redux-Saga Manual Ru</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="nfpk">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-comment/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../12-deklarativnie-effekti.html" />
    
    
    <link rel="prev" href="../bazovie-ponyatiya.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Введите условия поиска" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://www.gitbook.com/book/nfpk/redux-saga-ru" target="_blank" class="custom-link">Redux-Saga Manual Ru</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    1. Вступление
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../bazovie-ponyatiya.html">
            
                <a href="../bazovie-ponyatiya.html">
            
                    
                    2. Базовые Понятия
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.2.1" data-path="11-ispolzovanie-saga-helpers.html">
            
                <a href="11-ispolzovanie-saga-helpers.html">
            
                    
                    2.1 Использование Saga Helpers
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../12-deklarativnie-effekti.html">
            
                <a href="../12-deklarativnie-effekti.html">
            
                    
                    2.2 Декларативные эффекты
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="23-dispatchim-action-v-store.html">
            
                <a href="23-dispatchim-action-v-store.html">
            
                    
                    2.3 Диспатчим action в Store
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="24-error-handling.html">
            
                <a href="24-error-handling.html">
            
                    
                    2.4 Обработка ошибок
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="24-a-common-abstraction-effect.html">
            
                <a href="24-a-common-abstraction-effect.html">
            
                    
                    2.5 Базовая абстракция: Effect
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../1.html">
            
                <a href="../1.html">
            
                    
                    3. Дополнительные концепции
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../31.html">
            
                <a href="../31.html">
            
                    
                    3.1 Получение будущих действий
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../32-ne-blokiruyuschie-vizovi.html">
            
                <a href="../32-ne-blokiruyuschie-vizovi.html">
            
                    
                    3.2 Не блокирующие вызовы
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../33-running-tasks-in-parallel.html">
            
                <a href="../33-running-tasks-in-parallel.html">
            
                    
                    3.3 Запуск тасков параллельно
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="../34-zapusk-gonki-mezhdu-neskolkimi-effect-ami.html">
            
                <a href="../34-zapusk-gonki-mezhdu-neskolkimi-effect-ami.html">
            
                    
                    3.4 Запуск гонки между несколькими Effect-ами
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="../sequencing-sagas-via-yield.html">
            
                <a href="../sequencing-sagas-via-yield.html">
            
                    
                    3.5 Последовательность Saga через yield*
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.6" data-path="../36.html">
            
                <a href="../36.html">
            
                    
                    3.6 Составление Saga-ов
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.7" data-path="../310-primeri-testirovaniya-sagas.html">
            
                <a href="../310-primeri-testirovaniya-sagas.html">
            
                    
                    3.10 Примеры тестирования Saga-ов
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.8" data-path="../311-podklyuchenie-sagas-k-vneshnemu-vhoduvihodu.html">
            
                <a href="../311-podklyuchenie-sagas-k-vneshnemu-vhoduvihodu.html">
            
                    
                    3.11 Подключение Saga-ов к внешнему входу/выходу
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Опубликовано с помощью GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >2.1 Использование Saga Helpers</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="using-saga-helpers">&#x418;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; Saga Helpers </h1>
<p><code>redux-saga</code> &#x43F;&#x440;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; Helper &#x44D;&#x444;&#x444;&#x435;&#x43A;&#x442;&#x44B;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x432;&#x440;&#x430;&#x43F;&#x44F;&#x442; &#x432;&#x43D;&#x443;&#x442;&#x440;&#x435;&#x43D;&#x43D;&#x438;&#x435; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438; &#x434;&#x43B;&#x44F; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430; &#x437;&#x430;&#x434;&#x430;&#x447;, &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43D;&#x44B;&#x435; action &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x44E;&#x442;&#x441;&#x44F; &#x432; Store.</p>
<p>Helper &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438; &#x43F;&#x43E;&#x441;&#x442;&#x440;&#x43E;&#x435;&#x43D;&#x44B; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x445; API &#x43D;&#x438;&#x436;&#x43D;&#x435;&#x433;&#x43E; &#x443;&#x440;&#x43E;&#x432;&#x43D;&#x44F;. &#x412; &#x440;&#x430;&#x441;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x43D;&#x43E;&#x43C; &#x440;&#x430;&#x437;&#x434;&#x435;&#x43B;&#x435; &#x43C;&#x44B; &#x443;&#x432;&#x438;&#x434;&#x438;&#x43C;, &#x43A;&#x430;&#x43A; &#x44D;&#x442;&#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438; &#x43C;&#x43E;&#x433;&#x443;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x44B;. &#x41F;&#x435;&#x440;&#x432;&#x430;&#x44F; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44F; <code>takeEvery</code> &#x44F;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x43D;&#x430;&#x438;&#x431;&#x43E;&#x43B;&#x435;&#x435; &#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x43C;&#x43E;&#x439; &#x438; &#x43E;&#x431;&#x435;&#x441;&#x43F;&#x435;&#x447;&#x438;&#x432;&#x430;&#x435;&#x442; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x435; &#x43F;&#x43E;&#x445;&#x43E;&#x436;&#x435;&#x435; &#x43D;&#x430; <code>redux-thunk</code>.</p>
<p>&#x414;&#x430;&#x432;&#x430;&#x439;&#x442;&#x435; &#x440;&#x430;&#x441;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x438;&#x43C; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440; &#x441; AJAX.&#x41F;&#x440;&#x438; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x43C; &#x43D;&#x430;&#x436;&#x430;&#x442;&#x438;&#x438; &#x43D;&#x430; &#x43A;&#x43D;&#x43E;&#x43F;&#x43A;&#x443; <code>Fetch</code>, &#x43C;&#x44B; &#x434;&#x438;&#x441;&#x43F;&#x430;&#x442;&#x447;&#x438;&#x43C;  action <code>FETCH_REQUESTED</code> &#x438;  &#x445;&#x43E;&#x442;&#x438;&#x43C; &#x43E;&#x431;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x442;&#x44C; &#x435;&#x433;&#x43E; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x43E;&#x43C; &#x442;&#x430;&#x441;&#x43A;&#x430;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x431;&#x443;&#x434;&#x435;&#x442; &#x438;&#x437;&#x432;&#x43B;&#x435;&#x43A;&#x430;&#x442;&#x44C; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x435; &#x441; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440;&#x430;.</p>
<p>&#x421;&#x43D;&#x430;&#x447;&#x430;&#x43B;&#x430; &#x43C;&#x44B; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x435;&#x43C; &#x437;&#x430;&#x434;&#x430;&#x447;&#x443;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x430;&#x44F; &#x431;&#x443;&#x434;&#x435;&#x442; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x44F;&#x442;&#x44C; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x43E;&#x435; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x435; (<strong>Api.fetchUser</strong>):</p>
<pre><code class="lang-js"><span class="hljs-keyword">import</span> { call, put } <span class="hljs-keyword">from</span> <span class="hljs-string">&apos;redux-saga/effects&apos;</span>

<span class="hljs-keyword">export</span> <span class="hljs-function"><span class="hljs-keyword">function</span>* <span class="hljs-title">fetchData</span>(<span class="hljs-params">action</span>) </span>{
   <span class="hljs-keyword">try</span> {
      <span class="hljs-keyword">const</span> data = <span class="hljs-keyword">yield</span> call(Api.fetchUser, action.payload.url)
      <span class="hljs-keyword">yield</span> put({type: <span class="hljs-string">&quot;FETCH_SUCCEEDED&quot;</span>, data})
   } <span class="hljs-keyword">catch</span> (error) {
      <span class="hljs-keyword">yield</span> put({type: <span class="hljs-string">&quot;FETCH_FAILED&quot;</span>, error})
   }
}
</code></pre>
<p>&#x427;&#x442;&#x43E;&#x431;&#x44B; &#x442;&#x430;&#x441;&#x43A; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x43B;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x433;&#x43E; action <code>FETCH_REQUESTED</code>, &#x43D;&#x430;&#x43F;&#x438;&#x448;&#x435;&#x43C;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">import</span> { takeEvery } <span class="hljs-keyword">from</span> <span class="hljs-string">&apos;redux-saga/effects&apos;</span>

<span class="hljs-function"><span class="hljs-keyword">function</span>* <span class="hljs-title">watchFetchData</span>(<span class="hljs-params"></span>) </span>{
  <span class="hljs-keyword">yield</span> takeEvery(<span class="hljs-string">&apos;FETCH_REQUESTED&apos;</span>, fetchData)
}
</code></pre>
<p>&#x412; &#x43F;&#x440;&#x438;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43D;&#x43E;&#x43C; &#x432;&#x44B;&#x448;&#x435; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x435; <code>takeEvery</code> &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x435;&#x442; &#x43E;&#x434;&#x43D;&#x43E;&#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x43E; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x442;&#x44C; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x43E;&#x432; <code>fetchData</code> &#x43E;&#x434;&#x43D;&#x43E;&#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x43E;. &#x412; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x439; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442; &#x43C;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x43D;&#x43E;&#x432;&#x44B;&#x439; &#x442;&#x430;&#x441;&#x43A; <code>fetchData</code>, &#x43F;&#x43E;&#x43A;&#x430; &#x435;&#x441;&#x442;&#x44C; &#x432;&#x441;&#x435; &#x435;&#x449;&#x451; &#x437;&#x430;&#x43F;&#x443;&#x449;&#x435;&#x43D;&#x44B;&#x435; &#x442;&#x430;&#x441;&#x43A;&#x438;<code>fetchData</code>, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x435;&#x449;&#x435; &#x43D;&#x435; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x44B;.</p>
<p>&#x415;&#x441;&#x43B;&#x438; &#x43C;&#x44B; &#x445;&#x43E;&#x442;&#x438;&#x43C; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x442;&#x44C; &#x43E;&#x442;&#x432;&#x435;&#x442; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43E;&#x442; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43D;&#x435;&#x433;&#x43E; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x430; (&#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x432;&#x441;&#x435;&#x433;&#x434;&#x430; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43D;&#x44E;&#x44E; &#x432;&#x435;&#x440;&#x441;&#x438;&#x44E; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445;), &#x43C;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; helper <code>takeLatest</code>:</p>
<pre><code class="lang-js"><span class="hljs-keyword">import</span> { takeLatest } <span class="hljs-keyword">from</span> <span class="hljs-string">&apos;redux-saga/effects&apos;</span>

<span class="hljs-function"><span class="hljs-keyword">function</span>* <span class="hljs-title">watchFetchData</span>(<span class="hljs-params"></span>) </span>{
  <span class="hljs-keyword">yield</span> takeLatest(<span class="hljs-string">&apos;FETCH_REQUESTED&apos;</span>, fetchData)
}
</code></pre>
<p>&#x412; &#x43E;&#x442;&#x43B;&#x438;&#x447;&#x438;&#x435; &#x43E;&#x442; <code>takeEvery</code>, <code>takeLatest</code> &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x435;&#x442; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43E;&#x434;&#x438;&#x43D; &#x442;&#x430;&#x441;&#x43A; <code>fetchData</code> (&#x432; &#x43E;&#x434;&#x43D;&#x43E; &#x432;&#x440;&#x435;&#x43C;&#x44F;). <em> </em>&#x415;&#x441;&#x43B;&#x438; &#x43F;&#x440;&#x435;&#x434;&#x44B;&#x434;&#x443;&#x449;&#x430;&#x44F; &#x437;&#x430;&#x434;&#x430;&#x447;&#x430; &#x432;&#x441;&#x435; &#x435;&#x449;&#x435; &#x437;&#x430;&#x43F;&#x443;&#x449;&#x435;&#x43D;&#x430; &#x43F;&#x43E;&#x43A;&#x430; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x439; &#x442;&#x430;&#x441;&#x43A; <code>fetchData</code> &#x432;&#x441;&#x435; &#x435;&#x449;&#x451; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x435;&#x442;, &#x442;&#x43E; &#x442;&#x43E;&#x433;&#x434;&#x430; &#x43F;&#x440;&#x435;&#x434;&#x44B;&#x434;&#x443;&#x449;&#x430;&#x44F; &#x437;&#x430;&#x434;&#x430;&#x447;&#x430; &#x431;&#x443;&#x434;&#x435;&#x442; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438; &#x43E;&#x442;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x430;.</p>
<p>&#x415;&#x441;&#x43B;&#x438; &#x443; &#x432;&#x430;&#x441; &#x435;&#x441;&#x442;&#x44C; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x441;&#x430;&#x433;&#x43E;&#x432;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43D;&#x430;&#x431;&#x43B;&#x44E;&#x434;&#x430;&#x44E;&#x442; &#x437;&#x430; &#x440;&#x430;&#x437;&#x43B;&#x438;&#x447;&#x43D;&#x44B;&#x43C;&#x438; action, &#x432;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x442;&#x44C; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43D;&#x430;&#x431;&#x43B;&#x44E;&#x434;&#x430;&#x442;&#x435;&#x43B;&#x435;&#x439; &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; helper &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x431;&#x443;&#x434;&#x443;&#x442; &#x432;&#x435;&#x441;&#x442;&#x438; &#x441;&#x435;&#x431;&#x44F; &#x442;&#x430;&#x43A;,  &#x431;&#x443;&#x434;&#x442;&#x43E; &#x438;&#x445; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43B;&#x438; &#x447;&#x435;&#x440;&#x435;&#x437; <code>fork</code> (&#x43C;&#x44B; &#x43F;&#x43E;&#x433;&#x43E;&#x432;&#x43E;&#x440;&#x438;&#x43C;  &#x43E; <code>fork</code> &#x43F;&#x43E;&#x437;&#x436;&#x435;. &#x41D;&#x430; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x439; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442; &#x431;&#x443;&#x434;&#x435;&#x43C; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x441;&#x447;&#x438;&#x430;&#x442;&#x44C; &#x447;&#x442;&#x43E; &#x44D;&#x442;&#x43E;&#x442; Effect &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x435;&#x442; &#x43D;&#x430;&#x43C; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x442;&#x44C; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x441;&#x430;&#x433; &#x432; &#x444;&#x43E;&#x43D;&#x43E;&#x432;&#x43E;&#x43C; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x435;)</p>
<p>&#x41F;&#x440;&#x438;&#x43C;&#x435;&#x440;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">import</span> { takeEvery } <span class="hljs-keyword">from</span> <span class="hljs-string">&apos;redux-saga&apos;</span>

<span class="hljs-comment">// FETCH_USERS</span>
<span class="hljs-function"><span class="hljs-keyword">function</span>* <span class="hljs-title">fetchUsers</span>(<span class="hljs-params">action</span>) </span>{ ... }

<span class="hljs-comment">// CREATE_USER</span>
<span class="hljs-function"><span class="hljs-keyword">function</span>* <span class="hljs-title">createUser</span>(<span class="hljs-params">action</span>) </span>{ ... }

<span class="hljs-comment">// &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x435;&#x442; &#x438;&#x445; &#x43F;&#x430;&#x440;&#x430;&#x43B;&#x43B;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;</span>
<span class="hljs-keyword">export</span> <span class="hljs-keyword">default</span> <span class="hljs-function"><span class="hljs-keyword">function</span>* <span class="hljs-title">rootSaga</span>(<span class="hljs-params"></span>) </span>{
  <span class="hljs-keyword">yield</span> takeEvery(<span class="hljs-string">&apos;FETCH_USERS&apos;</span>, fetchUsers)
  <span class="hljs-keyword">yield</span> takeEvery(<span class="hljs-string">&apos;CREATE_USER&apos;</span>, createUser)
}
</code></pre>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../bazovie-ponyatiya.html" class="navigation navigation-prev " aria-label="Previous page: 2. Базовые Понятия">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../12-deklarativnie-effekti.html" class="navigation navigation-next " aria-label="Next page: 2.2 Декларативные эффекты">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"2.1 Использование Saga Helpers","level":"1.2.1","depth":2,"next":{"title":"2.2 Декларативные эффекты","level":"1.2.2","depth":2,"path":"12-deklarativnie-effekti.md","ref":"12-deklarativnie-effekti.md","articles":[]},"previous":{"title":"2. Базовые Понятия","level":"1.2","depth":1,"path":"bazovie-ponyatiya.md","ref":"bazovie-ponyatiya.md","articles":[{"title":"2.1 Использование Saga Helpers","level":"1.2.1","depth":2,"path":"bazovie-ponyatiya/11-ispolzovanie-saga-helpers.md","ref":"bazovie-ponyatiya/11-ispolzovanie-saga-helpers.md","articles":[]},{"title":"2.2 Декларативные эффекты","level":"1.2.2","depth":2,"path":"12-deklarativnie-effekti.md","ref":"12-deklarativnie-effekti.md","articles":[]},{"title":"2.3 Диспатчим action в Store","level":"1.2.3","depth":2,"path":"bazovie-ponyatiya/23-dispatchim-action-v-store.md","ref":"bazovie-ponyatiya/23-dispatchim-action-v-store.md","articles":[]},{"title":"2.4 Обработка ошибок","level":"1.2.4","depth":2,"path":"bazovie-ponyatiya/24-error-handling.md","ref":"bazovie-ponyatiya/24-error-handling.md","articles":[]},{"title":"2.5 Базовая абстракция: Effect","level":"1.2.5","depth":2,"path":"bazovie-ponyatiya/24-a-common-abstraction-effect.md","ref":"bazovie-ponyatiya/24-a-common-abstraction-effect.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["comment"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"comment":{"highlightCommented":true},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"nfpk","pdf":{"pageNumbers":true,"fontSize":16,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Redux-Saga Manual Ru","language":"ru","links":{"sidebar":{"Redux-Saga Manual Ru":"https://www.gitbook.com/book/nfpk/redux-saga-ru"},"gitbook":true},"gitbook":"*","description":""},"file":{"path":"bazovie-ponyatiya/11-ispolzovanie-saga-helpers.md","mtime":"2017-11-16T13:08:51.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2017-11-16T13:09:34.655Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-comment/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>
