
<!DOCTYPE HTML>
<html lang="ru" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>2.3 Диспатчим action в Store · Redux-Saga Manual Ru</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="nfpk">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-comment/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="24-error-handling.html" />
    
    
    <link rel="prev" href="../12-deklarativnie-effekti.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Введите условия поиска" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://www.gitbook.com/book/nfpk/redux-saga-ru" target="_blank" class="custom-link">Redux-Saga Manual Ru</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    1. Вступление
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../bazovie-ponyatiya.html">
            
                <a href="../bazovie-ponyatiya.html">
            
                    
                    2. Базовые Понятия
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="11-ispolzovanie-saga-helpers.html">
            
                <a href="11-ispolzovanie-saga-helpers.html">
            
                    
                    2.1 Использование Saga Helpers
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../12-deklarativnie-effekti.html">
            
                <a href="../12-deklarativnie-effekti.html">
            
                    
                    2.2 Декларативные эффекты
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.3" data-path="23-dispatchim-action-v-store.html">
            
                <a href="23-dispatchim-action-v-store.html">
            
                    
                    2.3 Диспатчим action в Store
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="24-error-handling.html">
            
                <a href="24-error-handling.html">
            
                    
                    2.4 Обработка ошибок
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="24-a-common-abstraction-effect.html">
            
                <a href="24-a-common-abstraction-effect.html">
            
                    
                    2.5 Базовая абстракция: Effect
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../1.html">
            
                <a href="../1.html">
            
                    
                    3. Дополнительные концепции
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../31.html">
            
                <a href="../31.html">
            
                    
                    3.1 Получение будущих действий
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../32-ne-blokiruyuschie-vizovi.html">
            
                <a href="../32-ne-blokiruyuschie-vizovi.html">
            
                    
                    3.2 Не блокирующие вызовы
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../33-running-tasks-in-parallel.html">
            
                <a href="../33-running-tasks-in-parallel.html">
            
                    
                    3.3 Запуск тасков параллельно
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="../34-zapusk-gonki-mezhdu-neskolkimi-effect-ami.html">
            
                <a href="../34-zapusk-gonki-mezhdu-neskolkimi-effect-ami.html">
            
                    
                    3.4 Запуск гонки между несколькими Effect-ами
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="../sequencing-sagas-via-yield.html">
            
                <a href="../sequencing-sagas-via-yield.html">
            
                    
                    3.5 Последовательность Saga через yield*
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.6" data-path="../36.html">
            
                <a href="../36.html">
            
                    
                    3.6 Составление Saga-ов
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.7" data-path="../310-primeri-testirovaniya-sagas.html">
            
                <a href="../310-primeri-testirovaniya-sagas.html">
            
                    
                    3.10 Примеры тестирования Saga-ов
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.8" data-path="../311-podklyuchenie-sagas-k-vneshnemu-vhoduvihodu.html">
            
                <a href="../311-podklyuchenie-sagas-k-vneshnemu-vhoduvihodu.html">
            
                    
                    3.11 Подключение Saga-ов к внешнему входу/выходу
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Опубликовано с помощью GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >2.3 Диспатчим action в Store</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="dispatching-actions-to-the-store">&#x414;&#x438;&#x441;&#x43F;&#x430;&#x442;&#x447;&#x438;&#x43C; action &#x432; Store </h1>
<p>&#x421;&#x43B;&#x435;&#x434;&#x443;&#x44F; &#x43F;&#x440;&#x435;&#x434;&#x44B;&#x434;&#x443;&#x449;&#x435;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x443;, &#x43F;&#x440;&#x435;&#x434;&#x43F;&#x43E;&#x43B;&#x43E;&#x436;&#x438;&#x43C;, &#x447;&#x442;&#x43E; &#x43F;&#x43E;&#x441;&#x43B;&#x435; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x433;&#x43E; &#x441;&#x43E;&#x445;&#x440;&#x430;&#x43D;&#x435;&#x43D;&#x438;&#x44F; &#x43C;&#x44B; &#x445;&#x43E;&#x442;&#x438;&#x43C; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x43A;&#x430;&#x43A;&#x43E;&#x435;-&#x43B;&#x438;&#x431;&#x43E; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x435;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x443;&#x432;&#x435;&#x434;&#x43E;&#x43C;&#x438;&#x442;&#x44C; Store &#x43E; &#x442;&#x43E;&#x43C;, &#x447;&#x442;&#x43E; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x435;&#x43D;&#x438;&#x435; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445; &#x43F;&#x440;&#x43E;&#x448;&#x43B;&#x43E; &#x443;&#x441;&#x43F;&#x435;&#x448;&#x43D;&#x43E; (&#x432; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x439; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442; &#x43C;&#x44B; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435;&#x43C; &#x434;&#x443;&#x43C;&#x430;&#x442;&#x44C; &#x43E; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x44B;&#x445; &#x43E;&#x448;&#x438;&#x431;&#x43A;&#x430;&#x445; &#x43F;&#x440;&#x438; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x435;&#x43D;&#x438;&#x438; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445;).</p>
<p>&#x41C;&#x44B; &#x43C;&#x43E;&#x433;&#x43B;&#x438; &#x431;&#x44B; &#x43F;&#x43E;&#x43C;&#x435;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44E; <code>dispatch</code> &#x432; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x438;  &#x437;&#x430;&#x442;&#x435;&#x43C; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x432;&#x44B;&#x437;&#x432;&#x430;&#x442;&#x44C; &#x435;&#x433;&#x43E; (<em>dispatch</em>) &#x43F;&#x43E;&#x441;&#x43B;&#x435; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x435;&#x43D;&#x438;&#x44F; &#x43E;&#x442;&#x432;&#x435;&#x442;&#x430;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// ...</span>

<span class="hljs-function"><span class="hljs-keyword">function</span>* <span class="hljs-title">fetchProducts</span>(<span class="hljs-params">dispatch</span>) </span>{
  <span class="hljs-keyword">const</span> products = <span class="hljs-keyword">yield</span> call(Api.fetch, <span class="hljs-string">&apos;/products&apos;</span>)
  dispatch({ type: <span class="hljs-string">&apos;PRODUCTS_RECEIVED&apos;</span>, products })
}
</code></pre>
<p>&#x41E;&#x434;&#x43D;&#x430;&#x43A;&#x43E; &#x44D;&#x442;&#x43E; &#x440;&#x435;&#x448;&#x435;&#x43D;&#x438;&#x435; &#x438;&#x43C;&#x435;&#x435;&#x442; &#x442;&#x435; &#x436;&#x435; &#x43D;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x430;&#x442;&#x43A;&#x438;, &#x447;&#x442;&#x43E; &#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438; &#x432;&#x44B;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x43C;&#x44B;&#x435; &#x43D;&#x435;&#x43F;&#x43E;&#x441;&#x440;&#x435;&#x434;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E; &#x438;&#x437;&#x43D;&#x443;&#x442;&#x440;&#x438; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; (&#x43A;&#x430;&#x43A; &#x431;&#x44B;&#x43B;&#x43E; &#x441;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43E; &#x432; &#x43F;&#x440;&#x435;&#x434;&#x44B;&#x434;&#x443;&#x449;&#x435;&#x43C; &#x440;&#x430;&#x437;&#x434;&#x435;&#x43B;&#x435;). &#x415;&#x441;&#x43B;&#x438; &#x43C;&#x44B; &#x445;&#x43E;&#x442;&#x438;&#x43C; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x438;&#x442;&#x44C;, &#x447;&#x442;&#x43E; <code>fetchProducts</code> &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x44F;&#x435;&#x442; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43A;&#x443; &#x43F;&#x43E;&#x441;&#x43B;&#x435; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x435;&#x43D;&#x438;&#x44F; &#x43E;&#x442;&#x432;&#x435;&#x442;&#x430; &#x43E;&#x442; AJAX, &#x442;&#x43E; &#x43D;&#x430;&#x43C; &#x43F;&#x440;&#x438;&#x434;&#x435;&#x442;&#x441;&#x44F; &#x43E;&#x43F;&#x44F;&#x442;&#x44C; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x432;&#x430;&#x442;&#x44C; mock-&#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44E; <code>dispatch</code>.</p>
<p>&#x412;&#x43C;&#x435;&#x441;&#x442;&#x43E; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x43D;&#x430;&#x43C; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x434;&#x435;&#x43A;&#x43B;&#x430;&#x440;&#x430;&#x442;&#x438;&#x432;&#x43D;&#x43E;&#x435; &#x440;&#x435;&#x448;&#x435;&#x43D;&#x438;&#x435;. &#x41F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x439;&#x442;&#x435; &#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442; &#x447;&#x442;&#x43E; &#x431;&#x44B; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x44C; middleware &#x447;&#x442;&#x43E; &#x43D;&#x430;&#x43C; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x434;&#x438;&#x441;&#x43F;&#x430;&#x447;&#x438;&#x442;&#x44C; action &#x438; &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44C;&#x442;&#x435; middleware &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x44C; &#x43D;&#x430;&#x441;&#x442;&#x43E;&#x44F;&#x44E;&#x449;&#x438;&#x44E; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43A;&#x443;<sup><a href="#fn_1" id="reffn_1">1</a></sup>. &#x422;&#x430;&#x43A;&#x438;&#x43C; &#x43E;&#x431;&#x440;&#x430;&#x437;&#x43E;&#x43C;, &#x43C;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x438;&#x442;&#x44C; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43A;&#x443; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x436;&#x435; &#x43E;&#x431;&#x440;&#x430;&#x437;&#x43E;&#x43C;: &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x438;&#x432; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x435;&#x43D;&#x43D;&#x44B;&#x439; &#x44D;&#x444;&#x444;&#x435;&#x43A;&#x442; &#x447;&#x435;&#x440;&#x435;&#x437; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x435;&#x43D;&#x44B;&#x439; &#x43E;&#x442; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; &#x438; &#x443;&#x431;&#x435;&#x434;&#x438;&#x442;&#x441;&#x44F;, &#x447;&#x442;&#x43E; &#x43E;&#x43D; &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x438;&#x442; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x446;&#x438;&#x438;.</p>
<p>&#x414;&#x43B;&#x44F; &#x44D;&#x442;&#x43E;&#x439; &#x446;&#x435;&#x43B;&#x438; &#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x43F;&#x440;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44E; <code>put</code> &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x434;&#x438;&#x441;&#x43F;&#x430;&#x442;&#x447;&#x438;&#x442; Effect.</p>
<pre><code class="lang-js"><span class="hljs-keyword">import</span> { call, put } <span class="hljs-keyword">from</span> <span class="hljs-string">&apos;redux-saga/effects&apos;</span>
<span class="hljs-comment">// ...</span>

<span class="hljs-function"><span class="hljs-keyword">function</span>* <span class="hljs-title">fetchProducts</span>(<span class="hljs-params"></span>) </span>{
  <span class="hljs-keyword">const</span> products = <span class="hljs-keyword">yield</span> call(Api.fetch, <span class="hljs-string">&apos;/products&apos;</span>)
  <span class="hljs-comment">// &#x441;&#x43E;&#x437;&#x434;&#x430;&#x435;&#x43C; &#x438; &#x434;&#x438;&#x441;&#x43F;&#x430;&#x442;&#x447;&#x438;&#x43C; Effect</span>
  <span class="hljs-keyword">yield</span> put({ type: <span class="hljs-string">&apos;PRODUCTS_RECEIVED&apos;</span>, products })
}
</code></pre>
<p>&#x422;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x43C;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x43B;&#x435;&#x433;&#x43A;&#x43E; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x44C; &#x442;&#x435;&#x441;&#x442; &#x434;&#x43B;&#x44F; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;, &#x43A;&#x430;&#x43A; &#x432; &#x43F;&#x440;&#x435;&#x434;&#x44B;&#x434;&#x443;&#x449;&#x435;&#x43C; &#x440;&#x430;&#x437;&#x434;&#x435;&#x43B;&#x435;</p>
<pre><code class="lang-js"><span class="hljs-keyword">import</span> { call, put } <span class="hljs-keyword">from</span> <span class="hljs-string">&apos;redux-saga/effects&apos;</span>
<span class="hljs-keyword">import</span> Api <span class="hljs-keyword">from</span> <span class="hljs-string">&apos;...&apos;</span>

<span class="hljs-keyword">const</span> iterator = fetchProducts()

<span class="hljs-comment">// expects a call instruction</span>
assert.deepEqual(
  iterator.next().value,
  call(Api.fetch, <span class="hljs-string">&apos;/products&apos;</span>),
  <span class="hljs-string">&quot;fetchProducts should yield an Effect call(Api.fetch, &apos;./products&apos;)&quot;</span>
)

<span class="hljs-comment">// &#x441;&#x43E;&#x437;&#x434;&#x430;&#x435;&#x43C; &#x444;&#x435;&#x439;&#x43A;&#x43E;&#x432;&#x44B;&#x439; &#x43E;&#x442;&#x432;&#x435;&#x442; &#x441; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440;&#x430;</span>
<span class="hljs-keyword">const</span> products = {}

<span class="hljs-comment">// &#x43E;&#x436;&#x438;&#x434;&#x430;&#x435;&#x442; &#x434;&#x438;&#x441;&#x43F;&#x430;&#x442;&#x447;&#x430;</span>
assert.deepEqual(
  iterator.next(products).value,
  put({ type: <span class="hljs-string">&apos;PRODUCTS_RECEIVED&apos;</span>, products }),
  <span class="hljs-string">&quot;fetchProducts should yield an Effect put({ type: &apos;PRODUCTS_RECEIVED&apos;, products })&quot;</span>
)
</code></pre>
<p>&#x41E;&#x431;&#x440;&#x430;&#x442;&#x438;&#x442;&#x435; &#x432;&#x43D;&#x438;&#x43C;&#x430;&#x43D;&#x438;&#x435;, &#x43A;&#x430;&#x43A; &#x43C;&#x44B; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x435;&#x43C; &#x444;&#x435;&#x439;&#x43A;&#x43E;&#x432;&#x44B;&#x439; &#x43E;&#x442;&#x432;&#x435;&#x442; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x443; &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x430; <code>next</code>. &#x412;&#x43E; &#x432;&#x43D;&#x435; middleware &#x43C;&#x44B; &#x438;&#x43C;&#x435;&#x435;&#x43C; &#x43F;&#x43E;&#x43B;&#x43D;&#x44B;&#x439; &#x43A;&#x43E;&#x43D;&#x442;&#x440;&#x43E;&#x43B;&#x44C; &#x43D;&#x430;&#x434; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x43E;&#x43C;, &#x43C;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x438;&#x43C;&#x438;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x440;&#x435;&#x430;&#x43B;&#x44C;&#x43D;&#x443;&#x44E; &#x441;&#x440;&#x435;&#x434;&#x443; &#x441; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x44B;&#x43C; &#x444;&#x435;&#x439;&#x43A;&#x43E;&#x432;&#x44B;&#x43C; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x43E;&#x43C; &#x438; &#x438; &#x432;&#x43E;&#x437;&#x430;&#x431;&#x43D;&#x43E;&#x432;&#x438;&#x442;&#x44C; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x441; &#x43D;&#x438;&#x43C;&#x438;. Mocking &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x435; &#x43D;&#x430;&#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x449;&#x435;, &#x447;&#x435;&#x43C; mock-&#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438; &#x438; [spying calls].</p>
<blockquote id="fn_1">
<sup>1</sup>. Just create an Object to instruct the middleware that we need to dispatch some action, and let the middleware perform the real dispatch.<a href="#reffn_1" title="Jump back to footnote [1] in the text."> &#x21A9;</a>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../12-deklarativnie-effekti.html" class="navigation navigation-prev " aria-label="Previous page: 2.2 Декларативные эффекты">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="24-error-handling.html" class="navigation navigation-next " aria-label="Next page: 2.4 Обработка ошибок">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"2.3 Диспатчим action в Store","level":"1.2.3","depth":2,"next":{"title":"2.4 Обработка ошибок","level":"1.2.4","depth":2,"path":"bazovie-ponyatiya/24-error-handling.md","ref":"bazovie-ponyatiya/24-error-handling.md","articles":[]},"previous":{"title":"2.2 Декларативные эффекты","level":"1.2.2","depth":2,"path":"12-deklarativnie-effekti.md","ref":"12-deklarativnie-effekti.md","articles":[]},"dir":"ltr"},"config":{"plugins":["comment"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"comment":{"highlightCommented":true},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"nfpk","pdf":{"pageNumbers":true,"fontSize":16,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Redux-Saga Manual Ru","language":"ru","links":{"sidebar":{"Redux-Saga Manual Ru":"https://www.gitbook.com/book/nfpk/redux-saga-ru"},"gitbook":true},"gitbook":"*","description":""},"file":{"path":"bazovie-ponyatiya/23-dispatchim-action-v-store.md","mtime":"2017-11-16T13:08:51.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2017-11-16T13:09:34.655Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-comment/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

