
<!DOCTYPE HTML>
<html lang="ru" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>3.1 Получение будущих действий · Redux-Saga Manual Ru</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="nfpk">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-comment/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="32-ne-blokiruyuschie-vizovi.html" />
    
    
    <link rel="prev" href="1.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Введите условия поиска" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://www.gitbook.com/book/nfpk/redux-saga-ru" target="_blank" class="custom-link">Redux-Saga Manual Ru</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    1. Вступление
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="bazovie-ponyatiya.html">
            
                <a href="bazovie-ponyatiya.html">
            
                    
                    2. Базовые Понятия
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="bazovie-ponyatiya/11-ispolzovanie-saga-helpers.html">
            
                <a href="bazovie-ponyatiya/11-ispolzovanie-saga-helpers.html">
            
                    
                    2.1 Использование Saga Helpers
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="12-deklarativnie-effekti.html">
            
                <a href="12-deklarativnie-effekti.html">
            
                    
                    2.2 Декларативные эффекты
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="bazovie-ponyatiya/23-dispatchim-action-v-store.html">
            
                <a href="bazovie-ponyatiya/23-dispatchim-action-v-store.html">
            
                    
                    2.3 Диспатчим action в Store
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="bazovie-ponyatiya/24-error-handling.html">
            
                <a href="bazovie-ponyatiya/24-error-handling.html">
            
                    
                    2.4 Обработка ошибок
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="bazovie-ponyatiya/24-a-common-abstraction-effect.html">
            
                <a href="bazovie-ponyatiya/24-a-common-abstraction-effect.html">
            
                    
                    2.5 Базовая абстракция: Effect
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="1.html">
            
                <a href="1.html">
            
                    
                    3. Дополнительные концепции
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.3.1" data-path="31.html">
            
                <a href="31.html">
            
                    
                    3.1 Получение будущих действий
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="32-ne-blokiruyuschie-vizovi.html">
            
                <a href="32-ne-blokiruyuschie-vizovi.html">
            
                    
                    3.2 Не блокирующие вызовы
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="33-running-tasks-in-parallel.html">
            
                <a href="33-running-tasks-in-parallel.html">
            
                    
                    3.3 Запуск тасков параллельно
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="34-zapusk-gonki-mezhdu-neskolkimi-effect-ami.html">
            
                <a href="34-zapusk-gonki-mezhdu-neskolkimi-effect-ami.html">
            
                    
                    3.4 Запуск гонки между несколькими Effect-ами
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="sequencing-sagas-via-yield.html">
            
                <a href="sequencing-sagas-via-yield.html">
            
                    
                    3.5 Последовательность Saga через yield*
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.6" data-path="36.html">
            
                <a href="36.html">
            
                    
                    3.6 Составление Saga-ов
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.7" data-path="310-primeri-testirovaniya-sagas.html">
            
                <a href="310-primeri-testirovaniya-sagas.html">
            
                    
                    3.10 Примеры тестирования Saga-ов
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.8" data-path="311-podklyuchenie-sagas-k-vneshnemu-vhoduvihodu.html">
            
                <a href="311-podklyuchenie-sagas-k-vneshnemu-vhoduvihodu.html">
            
                    
                    3.11 Подключение Saga-ов к внешнему входу/выходу
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Опубликовано с помощью GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >3.1 Получение будущих действий</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="pulling-future-actions">&#x41F;&#x43E;&#x43B;&#x443;&#x447;&#x435;&#x43D;&#x438;&#x435; &#x431;&#x443;&#x434;&#x443;&#x449;&#x438;&#x445; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x439; </h1>
<p>&#x414;&#x43E; &#x441;&#x438;&#x445; &#x43F;&#x43E;&#x440; &#x43C;&#x44B; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43B;&#x438; helper Effect <code>takeEvery</code>, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x442;&#x44C; &#x43D;&#x43E;&#x432;&#x44B;&#x439; &#x442;&#x430;&#x441;&#x43A; &#x434;&#x43B;&#x44F; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x433;&#x43E; &#x432;&#x445;&#x43E;&#x434;&#x44F;&#x449;&#x435;&#x433;&#x43E; action. &#x42D;&#x442;&#x43E; &#x43D;&#x435;&#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x43D;&#x430;&#x43F;&#x43E;&#x43C;&#x438;&#x43D;&#x430;&#x435;&#x442; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x435; <code>redux-thunk</code>: &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x43A;&#x430;&#x436;&#x434;&#x44B;&#x439; &#x440;&#x430;&#x437;, &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;, &#x432;&#x44B;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x442; <code>fetchProducts</code> Action Creator, Action Creator &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; thunk &#x434;&#x43B;&#x44F; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x435;&#x43D;&#x438;&#x44F; &#x43F;&#x43E;&#x442;&#x43E;&#x43A;&#x430; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F;.</p>
<p>&#x412; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438;, <code>takeEvery</code> - &#x432;&#x441;&#x435;&#x433;&#x43E; &#x43B;&#x438;&#x448;&#x44C; &#x432;&#x440;&#x430;&#x43F;&#x43F;&#x435;&#x440; &#x434;&#x43B;&#x44F; &#x432;&#x43D;&#x443;&#x442;&#x440;&#x435;&#x43D;&#x43D;&#x435;&#x439; &#x432;&#x441;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438;, &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x43D;&#x43E;&#x439; &#x43D;&#x430; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x435; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x43D;&#x438;&#x437;&#x43A;&#x43E;&#x433;&#x43E; &#x443;&#x440;&#x43E;&#x432;&#x43D;&#x44F; &#x438; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x43C;&#x43E;&#x449;&#x43D;&#x43E;&#x433;&#x43E; API. &#x412; &#x44D;&#x442;&#x43E;&#x43C; &#x440;&#x430;&#x437;&#x434;&#x435;&#x43B;&#x435; &#x43C;&#x44B; &#x443;&#x432;&#x438;&#x434;&#x438;&#x43C; &#x43D;&#x43E;&#x432;&#x44B;&#x439; Effect <code>take</code>, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x438;&#x442; &#x43F;&#x43E;&#x441;&#x442;&#x440;&#x43E;&#x438;&#x442;&#x44C; &#x441;&#x43B;&#x43E;&#x436;&#x43D;&#x44B;&#x439; &#x43F;&#x43E;&#x442;&#x43E;&#x43A; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F;, &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x44F; &#x43F;&#x43E;&#x43B;&#x43D;&#x43E;&#x441;&#x442;&#x44C;&#x44E; &#x43A;&#x43E;&#x43D;&#x442;&#x440;&#x43E;&#x43B;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;&#x441; &#x43D;&#x430;&#x431;&#x43B;&#x44E;&#x434;&#x435;&#x43D;&#x438;&#x44F; &#x437;&#x430; action.</p>
<h2 id="a-simple-logger">&#x41F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x439; &#x43B;&#x43E;&#x433;&#x433;&#x435;&#x440; action-&#x43E;&#x432; </h2>
<p>&#x414;&#x430;&#x432;&#x430;&#x439;&#x442;&#x435; &#x440;&#x430;&#x441;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x438;&#x43C; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x439; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440; &#x421;&#x430;&#x433;&#x438;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x430;&#x44F; &#x441;&#x43B;&#x435;&#x434;&#x438;&#x442; &#x437;&#x430; &#x432;&#x441;&#x435;&#x43C;&#x438; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x44F;&#x43C;&#x438;, &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44B;&#x43C;&#x438; &#x432; Store, &#x438; &#x432;&#x44B;&#x432;&#x43E;&#x434;&#x438;&#x442; &#x438;&#x445; &#x432; &#x43A;&#x43E;&#x43D;&#x441;&#x43E;&#x43B;&#x44C;.</p>
<p>&#x418;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x44F; <code>takeEvery(&apos;*&apos;)</code> (&#x441; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x43C; <code>*</code>) &#x43C;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x43E;&#x442;&#x43B;&#x43E;&#x432;&#x438;&#x442;&#x44C; &#x432;&#x441;&#x435; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44B;&#x435; action &#x43D;&#x435;&#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x43C;&#x43E; &#x43E;&#x442; &#x438;&#x445; &#x442;&#x438;&#x43F;&#x43E;&#x432;.</p>
<pre><code class="lang-js"><span class="hljs-keyword">import</span> { select, takeEvery } <span class="hljs-keyword">from</span> <span class="hljs-string">&apos;redux-saga/effects&apos;</span>

<span class="hljs-function"><span class="hljs-keyword">function</span>* <span class="hljs-title">watchAndLog</span>(<span class="hljs-params"></span>) </span>{
  <span class="hljs-keyword">yield</span> takeEvery(<span class="hljs-string">&apos;*&apos;</span>, <span class="hljs-function"><span class="hljs-keyword">function</span>* <span class="hljs-title">logger</span>(<span class="hljs-params">action</span>) </span>{
    <span class="hljs-keyword">const</span> state = <span class="hljs-keyword">yield</span> select()

    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&apos;action&apos;</span>, action)
    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&apos;state after&apos;</span>, state)
  })
}
</code></pre>
<p>&#x422;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x434;&#x430;&#x432;&#x430;&#x439;&#x442;&#x435; &#x43F;&#x43E;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x438;&#x43C;, &#x43A;&#x430;&#x43A; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; Effect <code>take</code> &#x434;&#x43B;&#x44F; &#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438; &#x442;&#x43E;&#x433;&#x43E; &#x436;&#x435; &#x43F;&#x43E;&#x442;&#x43E;&#x43A;&#x430;, &#x447;&#x442;&#x43E; &#x438; &#x432;&#x44B;&#x448;&#x435;</p>
<pre><code class="lang-js"><span class="hljs-keyword">import</span> { select, take } <span class="hljs-keyword">from</span> <span class="hljs-string">&apos;redux-saga/effects&apos;</span>

<span class="hljs-function"><span class="hljs-keyword">function</span>* <span class="hljs-title">watchAndLog</span>(<span class="hljs-params"></span>) </span>{
  <span class="hljs-keyword">while</span> (<span class="hljs-literal">true</span>) {
    <span class="hljs-keyword">const</span> action = <span class="hljs-keyword">yield</span> take(<span class="hljs-string">&apos;*&apos;</span>)
    <span class="hljs-keyword">const</span> state = <span class="hljs-keyword">yield</span> select()

    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&apos;action&apos;</span>, action)
    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&apos;state after&apos;</span>, state)
  }
}
</code></pre>
<p>Effect<code>take</code> &#x43F;&#x43E;&#x445;&#x43E;&#x436; &#x43D;&#x430; <code>call</code> &#x438; &#x43D;&#x430; <code>put</code> &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x43C;&#x44B; &#x432;&#x438;&#x434;&#x438;&#x43B;&#x438; &#x440;&#x430;&#x43D;&#x44C;&#x448;&#x435;. &#x41E;&#x43D; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x435;&#x442; &#x435;&#x449;&#x435; &#x43E;&#x434;&#x438;&#x43D; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x43D;&#x44B;&#x439; &#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442;,<sup><a href="#fn_1" id="reffn_1">1</a></sup> &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x430;&#x435;&#x442; middleware, &#x447;&#x442;&#x43E;-&#x431;&#x44B; &#x442;&#x43E;&#x442; &#x436;&#x434;&#x430;&#x43B; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x44F;.</p>
<p>&#x420;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x438;&#x440;&#x443;&#x44E;&#x449;&#x435;&#x435; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x435; Effect-&#x430; <code>call</code> &#x430;&#x43D;&#x430;&#x43B;&#x43E;&#x433;&#x438;&#x447;&#x43D;&#x43E; &#x442;&#x43E;&#x43C;&#x443;, &#x43A;&#x43E;&#x433;&#x434;&#x430; midleware &#x43F;&#x440;&#x438;&#x43E;&#x441;&#x442;&#x430;&#x43D;&#x430;&#x432;&#x43B;&#x438;&#x432;&#x430;&#x435;&#x442; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x434;&#x43E; &#x442;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x43A;&#x430; <code>Promise</code> &#x43D;&#x435; &#x432;&#x435;&#x440;&#x43D;&#x435;&#x442; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;. &#x412; &#x43F;&#x440;&#x438;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43D;&#x43E;&#x43C; &#x432;&#x44B;&#x448;&#x435; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x435; <code>watchAndLog</code> &#x43F;&#x440;&#x438;&#x43E;&#x441;&#x442;&#x430;&#x43D;&#x430;&#x432;&#x43B;&#x438;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x434;&#x43E; &#x442;&#x435;&#x445; &#x43F;&#x43E;&#x440; &#x43F;&#x43E;&#x43A;&#x430; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435;&#x442; &#x434;&#x438;&#x441;&#x43F;&#x430;&#x447;&#x435;&#x43D;&#x43E; &#x43A;&#x430;&#x43A;&#x43E;&#x435; &#x43D;&#x438;&#x431;&#x443;&#x434;&#x44C; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x435;.</p>
<p>&#x41E;&#x431;&#x440;&#x430;&#x442;&#x438;&#x442;&#x435; &#x432;&#x43D;&#x438;&#x43C;&#x430;&#x43D;&#x438;&#x435; &#x43D;&#x430; &#x442;&#x43E;, &#x43A;&#x430;&#x43A; &#x43C;&#x44B; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x435;&#x43C; &#x431;&#x435;&#x441;&#x43A;&#x43E;&#x43D;&#x435;&#x447;&#x43D;&#x44B;&#x439; &#x446;&#x438;&#x43A;&#x43B; <code>while (true)</code>.  &#x41F;&#x43E;&#x43C;&#x43D;&#x438;&#x442;&#x435;, &#x447;&#x442;&#x43E; &#x44D;&#x442;&#x43E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44F; &#x413;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x430;&#x44F; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x435;&#x442; &#x43D;&#x435; &#x442;&#x430;&#x43A;&#x436;&#x435; &#x43A;&#x430;&#x43A; &#x43E;&#x431;&#x44B;&#x447;&#x43D;&#x44B;&#x435; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438;.  &#x41D;&#x430;&#x448; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x430;&#x432;&#x43B;&#x438;&#x432;&#x430;&#x442;&#x441;&#x44F; &#x43D;&#x430; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x439; &#x438;&#x442;&#x435;&#x440;&#x430;&#x446;&#x438;&#x438; &#x432; &#x43E;&#x436;&#x438;&#x434;&#x430;&#x43D;&#x438;&#x438; &#x43F;&#x43E;&#x43A;&#x430; &#x43D;&#x435; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x430;&#x439;&#x434;&#x435;&#x442; &#x434;&#x438;&#x441;&#x43F;&#x430;&#x442;&#x447;.</p>
<p>&#x418;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; <code>take</code> &#x43E;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x442; &#x442;&#x43E;&#x43D;&#x43A;&#x43E;&#x435; &#x432;&#x43B;&#x438;&#x44F;&#x43D;&#x438;&#x435; &#x43D;&#x430; &#x442;&#x43E;, &#x43A;&#x430;&#x43A; &#x43C;&#x44B; &#x43F;&#x438;&#x448;&#x435;&#x43C; &#x43D;&#x430;&#x448; &#x43A;&#x43E;&#x434;. &#x412; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; <code>takeEvery</code> &#x432;&#x44B;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x43C;&#x44B;&#x435; &#x442;&#x430;&#x441;&#x43A;&#x438; &#x43D;&#x435; &#x43A;&#x43E;&#x43D;&#x442;&#x440;&#x43E;&#x43B;&#x438;&#x440;&#x443;&#x44E;&#x442;, &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x43E;&#x43D;&#x438; &#x431;&#x443;&#x434;&#x443;&#x442; &#x432;&#x44B;&#x437;&#x432;&#x430;&#x43D;&#x44B;. &#x41E;&#x43D;&#x438; &#x431;&#x443;&#x434;&#x443;&#x442; &#x432;&#x44B;&#x437;&#x44B;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x441;&#x43D;&#x43E;&#x432;&#x430; &#x438; &#x441;&#x43D;&#x43E;&#x432;&#x430; &#x434;&#x43B;&#x44F; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x433;&#x43E; &#x441;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x443;&#x44E;&#x449;&#x435;&#x433;&#x43E; action. &#x41E;&#x43D;&#x438; &#x442;&#x430;&#x43A;&#x436;&#x435; &#x43D;&#x435; &#x43A;&#x43E;&#x43D;&#x442;&#x440;&#x43E;&#x43B;&#x438;&#x440;&#x443;&#x44E;&#x442;, &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x438;&#x442;&#x44C; &#x43D;&#x430;&#x431;&#x43B;&#x44E;&#x434;&#x435;&#x43D;&#x438;&#x435;.</p>
<p>&#x412; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; &#x441; <code>take</code> &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x435; - &#x438;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x438;&#x440;&#x443;&#x435;&#x442;&#x441;&#x44F;. Instead of the actions being <em>pushed</em> to the handler tasks, the Saga is <em>pulling</em> the action by itself.  &#x42D;&#x442;&#x43E; &#x432;&#x44B;&#x433;&#x43B;&#x44F;&#x434;&#x438;&#x442; &#x442;&#x430;&#x43A;, &#x43A;&#x430;&#x43A; &#x431;&#x443;&#x434;&#x442;&#x43E; Saga &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x44F;&#x435;&#x442; &#x43D;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x443;&#x44E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44E; <code>action = getNextAction()</code>, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x430;&#x44F; &#x431;&#x443;&#x434;&#x435;&#x442; &#x440;&#x435;&#x448;&#x430;&#x442;&#x44C;, &#x43A;&#x43E;&#x433;&#x434;&#x430; action &#x431;&#x443;&#x434;&#x435;&#x442; &#x434;&#x438;&#x441;&#x43F;&#x430;&#x442;&#x447;&#x435;&#x43D;.</p>
<p>&#x42D;&#x442;&#x430; &#x438;&#x43D;&#x432;&#x435;&#x440;&#x441;&#x438;&#x44F; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x435;&#x442; &#x43D;&#x430;&#x43C; &#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43F;&#x43E;&#x442;&#x43E;&#x43A;&#x438; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43D;&#x435;&#x442;&#x440;&#x438;&#x432;&#x438;&#x430;&#x43B;&#x44C;&#x43D;&#x44B; &#x434;&#x43B;&#x44F; &#x442;&#x440;&#x430;&#x434;&#x438;&#x446;&#x438;&#x43E;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x434;&#x445;&#x43E;&#x434;&#x430; <em>push</em>.</p>
<p>&#x412; &#x43A;&#x430;&#x447;&#x435;&#x441;&#x442;&#x432;&#x435; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x430; &#x43F;&#x440;&#x435;&#x434;&#x43F;&#x43E;&#x43B;&#x43E;&#x436;&#x438;&#x43C;, &#x447;&#x442;&#x43E; &#x432; &#x43D;&#x430;&#x448;&#x435;&#x43C; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x438; <strong>Todo</strong> &#x43C;&#x44B; &#x445;&#x43E;&#x442;&#x438;&#x43C; &#x43F;&#x43E;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x435;&#x442;&#x44C; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x44F; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44F; &#x438; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x44C; &#x43F;&#x43E;&#x437;&#x434;&#x440;&#x430;&#x432;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x435; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x43D;&#x438;&#x435; &#x43F;&#x43E;&#x441;&#x43B;&#x435; &#x442;&#x43E;&#x433;&#x43E;, &#x43A;&#x430;&#x43A; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43B; &#x441;&#x432;&#x43E;&#x438; &#x43F;&#x435;&#x440;&#x432;&#x44B;&#x435; &#x442;&#x440;&#x438; &#x437;&#x430;&#x43C;&#x435;&#x442;&#x43A;&#x438;.</p>
<pre><code class="lang-js"><span class="hljs-keyword">import</span> { take, put } <span class="hljs-keyword">from</span> <span class="hljs-string">&apos;redux-saga/effects&apos;</span>

<span class="hljs-function"><span class="hljs-keyword">function</span>* <span class="hljs-title">watchFirstThreeTodosCreation</span>(<span class="hljs-params"></span>) </span>{
  <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> i = <span class="hljs-number">0</span>; i &lt; <span class="hljs-number">3</span>; i++) {
    <span class="hljs-keyword">const</span> action = <span class="hljs-keyword">yield</span> take(<span class="hljs-string">&apos;TODO_CREATED&apos;</span>)
  }
  <span class="hljs-keyword">yield</span> put({type: <span class="hljs-string">&apos;SHOW_CONGRATULATION&apos;</span>})
}
</code></pre>
<p>Instead of a <code>while (true)</code> we&apos;re running a <code>for</code> loop which will iterate only three times. After taking the first three <code>TODO_CREATED</code> actions, <code>watchFirstThreeTodosCreation</code> will cause the application to display a congratulation message then terminate. This means the Generator will be garbage collected and no more observation will take place.</p>
<p>Another benefit of the pull approach is that we can describe our control flow using a familiar synchronous style. For example, suppose we want to implement a login flow with two actions <code>LOGIN</code> and <code>LOGOUT</code>. Using <code>takeEvery</code> (or <code>redux-thunk</code>) we&apos;ll have to write two separate tasks (or thunks): one for <code>LOGIN</code> and the other for <code>LOGOUT</code>.</p>
<p>The result is that our logic is now spread in two places. In order for someone reading our code to understand it, they would have to read the source of the two handlers and make the link between the logic in both in their head. In other words, it means they would have to rebuild the model of the flow in their head by rearranging mentally the logic placed in various places of the code in the correct order.</p>
<p>Using the pull model we can write our flow in the same place instead of handling the same action repeatedly.</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span>* <span class="hljs-title">loginFlow</span>(<span class="hljs-params"></span>) </span>{
  <span class="hljs-keyword">while</span> (<span class="hljs-literal">true</span>) {
    <span class="hljs-keyword">yield</span> take(<span class="hljs-string">&apos;LOGIN&apos;</span>)
    <span class="hljs-comment">// ... &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x44F;&#x435;&#x43C; &#x43B;&#x43E;&#x433;&#x438;&#x43A;&#x443; &#x430;&#x432;&#x442;&#x43E;&#x440;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438;</span>
    <span class="hljs-keyword">yield</span> take(<span class="hljs-string">&apos;LOGOUT&apos;</span>)
    <span class="hljs-comment">// ... &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x44F;&#x435;&#x43C; &#x43B;&#x43E;&#x433;&#x438;&#x43A;&#x443; &#x432;&#x44B;&#x445;&#x43E;&#x434;&#x430;</span>
  }
}
</code></pre>
<p><code>loginFlow</code>  &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x447;&#x435;&#x442;&#x43A;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x435;&#x442; &#x43E;&#x436;&#x438;&#x434;&#x430;&#x435;&#x43C;&#x443;&#x44E; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x439;. &#x41E;&#x43D; &#x437;&#x43D;&#x430;&#x435;&#x442;, &#x447;&#x442;&#x43E; &#x437;&#x430; action <code>LOGIN</code> &#x432;&#x441;&#x435;&#x433;&#x434;&#x430; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x435;&#x442; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x435; <code>LOGOUT</code> &#x438; &#x447;&#x442;&#x43E; <code>LOGOUT</code> &#x432;&#x441;&#x435;&#x433;&#x434;&#x430; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x435;&#x442; <code>LOGIN</code> (&#x445;&#x43E;&#x440;&#x43E;&#x448;&#x438;&#x439; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x441;&#x43A;&#x438;&#x439; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441; &#x434;&#x43E;&#x43B;&#x436;&#x435;&#x43D; &#x432;&#x441;&#x435;&#x433;&#x434;&#x430; &#x43E;&#x431;&#x435;&#x441;&#x43F;&#x435;&#x447;&#x438;&#x432;&#x430;&#x442;&#x44C; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x439;, &#x441;&#x43A;&#x440;&#x44B;&#x432;&#x430;&#x44F; &#x438;&#x43B;&#x438; &#x43E;&#x442;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x44F; &#x43D;&#x435;&#x43E;&#x436;&#x438;&#x434;&#x430;&#x43D;&#x43D;&#x43E;&#x435; &#x444;&#x441;&#x435;&#x448;&#x449;&#x442;).</p>
<blockquote id="fn_1">
<sup>1</sup>. It creates another command object<a href="#reffn_1" title="Jump back to footnote [1] in the text."> &#x21A9;</a>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="1.html" class="navigation navigation-prev " aria-label="Previous page: 3. Дополнительные концепции">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="32-ne-blokiruyuschie-vizovi.html" class="navigation navigation-next " aria-label="Next page: 3.2 Не блокирующие вызовы">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"3.1 Получение будущих действий","level":"1.3.1","depth":2,"next":{"title":"3.2 Не блокирующие вызовы","level":"1.3.2","depth":2,"path":"32-ne-blokiruyuschie-vizovi.md","ref":"32-ne-blokiruyuschie-vizovi.md","articles":[]},"previous":{"title":"3. Дополнительные концепции","level":"1.3","depth":1,"path":"1.md","ref":"1.md","articles":[{"title":"3.1 Получение будущих действий","level":"1.3.1","depth":2,"path":"31.md","ref":"31.md","articles":[]},{"title":"3.2 Не блокирующие вызовы","level":"1.3.2","depth":2,"path":"32-ne-blokiruyuschie-vizovi.md","ref":"32-ne-blokiruyuschie-vizovi.md","articles":[]},{"title":"3.3 Запуск тасков параллельно","level":"1.3.3","depth":2,"path":"33-running-tasks-in-parallel.md","ref":"33-running-tasks-in-parallel.md","articles":[]},{"title":"3.4 Запуск гонки между несколькими Effect-ами","level":"1.3.4","depth":2,"path":"34-zapusk-gonki-mezhdu-neskolkimi-effect-ami.md","ref":"34-zapusk-gonki-mezhdu-neskolkimi-effect-ami.md","articles":[]},{"title":"3.5 Последовательность Saga через yield*","level":"1.3.5","depth":2,"path":"sequencing-sagas-via-yield.md","ref":"sequencing-sagas-via-yield.md","articles":[]},{"title":"3.6 Составление Saga-ов","level":"1.3.6","depth":2,"path":"36.md","ref":"36.md","articles":[]},{"title":"3.10 Примеры тестирования Saga-ов","level":"1.3.7","depth":2,"path":"310-primeri-testirovaniya-sagas.md","ref":"310-primeri-testirovaniya-sagas.md","articles":[]},{"title":"3.11 Подключение Saga-ов к внешнему входу/выходу","level":"1.3.8","depth":2,"path":"311-podklyuchenie-sagas-k-vneshnemu-vhoduvihodu.md","ref":"311-podklyuchenie-sagas-k-vneshnemu-vhoduvihodu.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["comment"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"comment":{"highlightCommented":true},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"nfpk","pdf":{"pageNumbers":true,"fontSize":16,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Redux-Saga Manual Ru","language":"ru","links":{"sidebar":{"Redux-Saga Manual Ru":"https://www.gitbook.com/book/nfpk/redux-saga-ru"},"gitbook":true},"gitbook":"*","description":""},"file":{"path":"31.md","mtime":"2017-11-16T13:08:51.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2017-11-16T13:09:34.655Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-comment/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

